Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>pl-strflt</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["gotest-json-to-junit-xml:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJI3ZbA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.this["saxon:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJI1mfg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_repository_file.this["gotest-json-to-junit-xml/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "gotest-json-to-junit-xml"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["saxon/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "saxon"
      + sha                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->